import random

STARTING_STRINGS = [
# roster part
    "正在擦拭薇格弗德的头盔",
    "正在编织威尔逊的胡子",
    "正在给薇洛的火机添加燃料",
    "正在将沃尔夫冈的哑铃替换成泡沫材料",
    "正在打扫温蒂姐姐的骨灰盒",
    "正在给WX-78的零件添加润滑油",
    "正在检查薇克巴顿图书馆的灭火器",
    "正在装饰伍迪小屋的鹿角",
    "正在给韦斯的表演鼓掌",
    "正在给麦斯威尔的书中添加书签",
    "正在疏通韦伯的口哨",
    "正在给薇诺娜的电机充电",
    "正在整理沃利的锅具",
    "正在扎紧沃尔特的弹弓",
    "正在检查沃托克斯的胃",
    "正在培育沃姆伍德头顶的花",
    "正在拉开沃特和猪人",
    "正在偷偷拨乱旺达的指针",
    "正在捡起芜猴的诅咒",
# world part
    "正在给格罗姆建造雕像",
    "正在为月亮码头挖走沉沙",
    "正在为陨石瞄准角度",
    "正在为高出平均值的树干测量高度",
    "正在修补梦魇城墙周围的裂缝",
    "正在连接非自然传送门",
    "正在雕塑大理石柱",
    "正在吟唱冬日赞歌",
]


def give_some_startings(n):
    return random.sample(STARTING_STRINGS, n)
